<?php

$tt=$hod_two; unset($dona); $tt_one=$hod_one;





                                          




if($sh[$tt_one]=='3' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp' && $sh[$tt]=='40') {  

if($sh[$tt+1]=='3' || $sh[$tt+1]=='4' || $sh[$tt+1]=='7' || $sh[$tt+1]=='8') { $dona='10'; }
if($sh[$tt-1]=='3' || $sh[$tt-1]=='4' || $sh[$tt-1]=='7' || $sh[$tt-1]=='8') { $dona='10'; }
if($sh[$tt+24]=='3' || $sh[$tt+24]=='4' || $sh[$tt+24]=='7' || $sh[$tt+24]=='8') { $dona='10'; }
if($sh[$tt-24]=='3' || $sh[$tt-24]=='4' || $sh[$tt-24]=='7' || $sh[$tt-24]=='8') { $dona='10'; }
if($sh[$tt+23]=='3' || $sh[$tt+23]=='4' || $sh[$tt+23]=='7' || $sh[$tt+23]=='8') { $dona='10'; }
if($sh[$tt-23]=='3' || $sh[$tt-23]=='4' || $sh[$tt-23]=='7' || $sh[$tt-23]=='8') { $dona='10'; }
if($sh[$tt+25]=='3' || $sh[$tt+25]=='4' || $sh[$tt+25]=='7' || $sh[$tt+25]=='8') { $dona='10'; }
if($sh[$tt-25]=='3' || $sh[$tt-25]=='4' || $sh[$tt-25]=='7' || $sh[$tt-25]=='8') { $dona='10'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp' && $sh[$tt]=='40') { 

if($sh[$tt+1]=='13' || $sh[$tt+1]=='14' || $sh[$tt+1]=='17' || $sh[$tt+1]=='18') { $dona='10'; }
if($sh[$tt-1]=='13' || $sh[$tt-1]=='14' || $sh[$tt-1]=='17' || $sh[$tt-1]=='18') { $dona='10'; }
if($sh[$tt+24]=='13' || $sh[$tt+24]=='14' || $sh[$tt+24]=='17' || $sh[$tt+24]=='18') { $dona='10'; }
if($sh[$tt-24]=='13' || $sh[$tt-24]=='14' || $sh[$tt-24]=='17' || $sh[$tt-24]=='18') { $dona='10'; }
if($sh[$tt+23]=='13' || $sh[$tt+23]=='14' || $sh[$tt+23]=='17' || $sh[$tt+23]=='18') { $dona='10'; }
if($sh[$tt-23]=='13' || $sh[$tt-23]=='14' || $sh[$tt-23]=='17' || $sh[$tt-23]=='18') { $dona='10'; }
if($sh[$tt+25]=='13' || $sh[$tt+25]=='14' || $sh[$tt+25]=='17' || $sh[$tt+25]=='18') { $dona='10'; }
if($sh[$tt-25]=='13' || $sh[$tt-25]=='14' || $sh[$tt-25]=='17' || $sh[$tt-25]=='18') { $dona='10'; }

}}





                                          




if($sh[$tt_one]=='3' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+22]=='13') { $dona='3'; }
if($sh[$tt+26]=='13') { $dona='3'; }
if($sh[$tt-22]=='13') { $dona='3'; }
if($sh[$tt-26]=='13') { $dona='3'; }

if($sh[$tt+47]=='13') { $dona='3'; }
if($sh[$tt+49]=='13') { $dona='3'; }
if($sh[$tt-47]=='13') { $dona='3'; }
if($sh[$tt-49]=='13') { $dona='3'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-22]=='3') { $dona='3'; }
if($sh[$tt-26]=='3') { $dona='3'; }
if($sh[$tt+22]=='3') { $dona='3'; }
if($sh[$tt+26]=='3') { $dona='3'; }

if($sh[$tt-47]=='3') { $dona='3'; }
if($sh[$tt-49]=='3') { $dona='3'; }
if($sh[$tt+47]=='3') { $dona='3'; }
if($sh[$tt+49]=='3') { $dona='3'; }

}}











if($sh[$tt_one]=='3' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='14') { $dona='4'; }
if($sh[$tt+25]=='14') { $dona='4'; }
if($sh[$tt-23]=='14') { $dona='4'; }
if($sh[$tt-25]=='14') { $dona='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='4') { $dona='4'; }
if($sh[$tt-25]=='4') { $dona='4'; }
if($sh[$tt+23]=='4') { $dona='4'; }
if($sh[$tt+25]=='4') { $dona='4'; }

}}








                                          




if($sh[$tt_one]=='3' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+22]=='18') { $dona='8'; }
if($sh[$tt+26]=='18') { $dona='8'; }
if($sh[$tt-22]=='18') { $dona='8'; }
if($sh[$tt-26]=='18') { $dona='8'; }

if($sh[$tt+47]=='18') { $dona='8'; }
if($sh[$tt+49]=='18') { $dona='8'; }
if($sh[$tt-47]=='18') { $dona='8'; }
if($sh[$tt-49]=='18') { $dona='8'; }

if($sh[$tt+48]=='18') { $dona='8'; }
if($sh[$tt+2]=='18') { $dona='8'; }
if($sh[$tt-48]=='18') { $dona='8'; }
if($sh[$tt-2]=='18') { $dona='8'; }

if($sh[$tt+46]=='18') { $dona='8'; }
if($sh[$tt+50]=='18') { $dona='8'; }
if($sh[$tt-46]=='18') { $dona='8'; }
if($sh[$tt-50]=='18') { $dona='8'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-22]=='8') { $dona='8'; }
if($sh[$tt-26]=='8') { $dona='8'; }
if($sh[$tt+22]=='8') { $dona='8'; }
if($sh[$tt+26]=='8') { $dona='8'; }

if($sh[$tt-47]=='8') { $dona='8'; }
if($sh[$tt-49]=='8') { $dona='8'; }
if($sh[$tt+47]=='8') { $dona='8'; }
if($sh[$tt+49]=='8') { $dona='8'; }

if($sh[$tt-48]=='8') { $dona='8'; }
if($sh[$tt-2]=='8') { $dona='8'; }
if($sh[$tt+48]=='8') { $dona='8'; }
if($sh[$tt+2]=='8') { $dona='8'; }

if($sh[$tt-46]=='8') { $dona='8'; }
if($sh[$tt-50]=='8') { $dona='8'; }
if($sh[$tt+46]=='8') { $dona='8'; }
if($sh[$tt+50]=='8') { $dona='8'; }

}}











                                          




if($sh[$tt_one]=='3' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+72]=='17') { $dona='7'; }
if($sh[$tt+3]=='17') { $dona='7'; }
if($sh[$tt-72]=='17') { $dona='7'; }
if($sh[$tt-3]=='17') { $dona='7'; }

if($sh[$tt+69]=='17') { $dona='7'; }
if($sh[$tt+75]=='17') { $dona='7'; }
if($sh[$tt-69]=='17') { $dona='7'; }
if($sh[$tt-75]=='17') { $dona='7'; }

if($sh[$tt+47]=='17') { $dona='7'; }
if($sh[$tt+2]=='17') { $dona='7'; }
if($sh[$tt-47]=='17') { $dona='7'; }
if($sh[$tt-2]=='17') { $dona='7'; }

if($sh[$tt+46]=='17') { $dona='7'; }
if($sh[$tt+50]=='17') { $dona='7'; }
if($sh[$tt-46]=='17') { $dona='7'; }
if($sh[$tt-50]=='17') { $dona='7'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-72]=='7') { $dona='7'; }
if($sh[$tt-3]=='7') { $dona='7'; }
if($sh[$tt+72]=='7') { $dona='7'; }
if($sh[$tt+3]=='7') { $dona='7'; }

if($sh[$tt-69]=='7') { $dona='7'; }
if($sh[$tt-75]=='7') { $dona='7'; }
if($sh[$tt+69]=='7') { $dona='7'; }
if($sh[$tt+75]=='7') { $dona='7'; }

if($sh[$tt-47]=='7') { $dona='7'; }
if($sh[$tt-2]=='7') { $dona='7'; }
if($sh[$tt+47]=='7') { $dona='7'; }
if($sh[$tt+2]=='7') { $dona='7'; }

if($sh[$tt-46]=='7') { $dona='7'; }
if($sh[$tt-50]=='7') { $dona='7'; }
if($sh[$tt+46]=='7') { $dona='7'; }
if($sh[$tt+50]=='7') { $dona='7'; }

}}








// ниже слон
// ниже проверка через 1 клетку

if($sh[$tt_one]=='3' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='14') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='14') { $dona='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='14') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='14') { $dona='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='4') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='4') { $dona='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='4') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='4') { $dona='4'; }

}}









// ниже проверка через 2 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='14') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='14') { $dona='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='14') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='14') { $dona='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='4') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='4') { $dona='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='4') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='4') { $dona='4'; }

}}








// ниже проверка через 3 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='14') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='14') { $dona='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='14') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='14') { $dona='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='4') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='4') { $dona='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='4') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='4') { $dona='4'; }

}}








// ниже проверка через 4 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='14') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='14') { $dona='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='14') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='14') { $dona='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='4') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='4') { $dona='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='4') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='4') { $dona='4'; }

}}







// ниже проверка через 5 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='14') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='14') { $dona='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='14') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='14') { $dona='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='4') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='4') { $dona='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='4') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='4') { $dona='4'; }

}}







// ниже проверка через 6 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='40' && $sh[$tt+161]=='14') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='40' && $sh[$tt+175]=='14') { $dona='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='40' && $sh[$tt-161]=='14') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='40' && $sh[$tt-175]=='14') { $dona='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='40' && $sh[$tt-161]=='4') { $dona='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='40' && $sh[$tt-175]=='4') { $dona='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='40' && $sh[$tt+161]=='4') { $dona='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='40' && $sh[$tt+175]=='4') { $dona='4'; }

}}







                                         


if($dona=='3') { echo 'Атака отменяется,защита конем<br>'; }
if($dona=='4') { echo 'Атака отменяется,защита слоном<br>'; }
if($dona=='8') { echo 'Атака отменяется,защита медведем<br>'; }
if($dona=='7') { echo 'Атака отменяется,защита ястребом<br>'; }
if($dona=='10') { echo 'Ход отменяется,не взрываем свою фигуру<br>'; }
if($dona>'9') {  $hod_one='1000';  $hod_two='1000'; $ee=rand(0,2); if($ee==1) { include('coord_zapas.php'); } }

//переборщил,если $dona <10 то фигуры не приближаются друг к другу


?>