<? // WR-Gallery v 1.5  //  14.06.10 г.  //  Miha-ingener@yandex.ru
$glname="Коллекция улётных фотоприколов 2010-2011 г. "; // Имя галереи отображается в теге TITLE и заголовке
$maintext="В фотогалерее я постарался собрать самые интересные фотки. Если Вы хотите пополнить мою коллекцию - просто добавьте фото!"; // Текст, выводящийся перед формой ввода сообщения
$adminemail="email@email.ru"; // Емайл админа
$password="6173522b31c6a3312c813550daa56e33"; // Пароль админа защифрован md5()
$sendmail="0"; // отсылать сообщения на Емайл админу
$smwidth="150"; // Ширина миниизображения
$smheight="120"; // Высота миниизображения
$whofotoadd="1"; // Кто может добавлять фото? всё/админ 1/0
$antispam="1"; // Задействовать АНТИСПАМ
$rand_key="6592"; // Случайное число для цифрозащиты
$max_key="3"; // Кол-во символов в коде ЦИФРОЗАЩИТЫ
$max_file_size="102400"; // Максимально допустимый размер загружаемого фото
$maxwidth="1024"; // Ширина загружаемого изображения в пикселях не более
$maxheight="768"; // Высота -||- 
$maxname="25";  // Максимальное кол-во символов в имени
$maxmsg="70"; // Максимальное кол-во символов в сообщении
$maxzag="100"; // Макс. кол-во символов в комментарии
$msginout="0"; // порядок просмотра сообщений: возрастание/убывание - 1/0
$qq="9"; // кол-во отображаемых сообщений на каждой странице галереи: 1-100
$colrubperpage="3"; // Кол-во столбцов с фотками
$datadir="./data"; // Каталог с фото и комментариями/оценками
$gal_skin="skin-dvduck"; // скин галререи
$date=date("d.m.y"); // число.месяц.год
$time=date("H:i"); // часы:минуты 
?>