<? // WR-Gallery v 1.5  //  14.06.10 г.  //  Miha-ingener@yandex.ru
$glname="Галерея,хранилище фоток ,установлена 26.12.2023 "; // Имя галереи отображается в теге TITLE и заголовке
$maintext="В фотогалерее я постараюсь собрать самые интересные фотки. Если Вы хотите пополнить мою галерею - просто добавьте фото!"; // Текст, выводящийся перед формой ввода сообщения
$adminemail="unlater2@mail.ru"; // Емайл админа
$admin="admin";
$password="d5d06c0b9ed29000a45053b8594e9082"; // Пароль админа защифрован md5()
$sendmail="0"; // отсылать сообщения на Емайл админу
$smwidth="150"; // Ширина миниизображения
$smheight="120"; // Высота миниизображения
$whofotoadd="1"; // Кто может добавлять фото? всё/админ 1/0
$antispam="0"; // Задействовать АНТИСПАМ
$rand_key="8047"; // Случайное число для цифрозащиты
$max_key="1"; // Кол-во символов в коде ЦИФРОЗАЩИТЫ
$max_file_size="20000000"; // Максимально допустимый размер загружаемого фото
$maxwidth="4200"; // Ширина загружаемого изображения в пикселях не более
$maxheight="6000"; // Высота -||- 
$maxname="25";  // Максимальное кол-во символов в имени
$maxmsg="70"; // Максимальное кол-во символов в сообщении
$maxzag="100"; // Макс. кол-во символов в комментарии
$msginout="0"; // порядок просмотра сообщений: возрастание/убывание - 1/0
$qq="99"; // кол-во отображаемых сообщений на каждой странице галереи: 1-100
$colrubperpage="3"; // Кол-во столбцов с фотками
$datadir="./data"; // Каталог с фото и комментариями/оценками
$gal_skin="skin-dvduck"; // скин галререи
$date=date("d.m.y"); // число.месяц.год
$time=date("H:i"); // часы:минуты 
?>