<?

// echo '<br>';

for($i=0;$i<300;$i++)  {  

$sh_prov[$i]=$sh[$i];

 // echo '&nbsp;&nbsp;&nbsp;$sh['.$i.'] = '.$sh[$i];

if($sh[$i]=='12')  {  // проверка белая тура вверх есть ли шах
                           if($sh[$i-24]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='40' & $sh[$i-192]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи - ['.$i.']'; $shah='1'; }
               if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='40' & $sh[$i-192]=='40' & $sh[$i-216]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи - ['.$i.']'; $shah='1'; }


                           }  // конец белая тура вверх






if($sh[$i]=='12')  {  // проверка белая тура вниз есть ли шах
                           if($sh[$i+24]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='40' & $sh[$i+192]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.']'; $shah='1'; }
               if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='40' & $sh[$i+192]=='40' & $sh[$i+216]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.']'; $shah='1'; }


                           }  // конец белая тура вниз








if($sh[$i]=='2')  {  // проверка черная тура вверх есть ли шах
                           if($sh[$i-24]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='40' & $sh[$i-192]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи - ['.$i.']'; $shah='2'; }
               if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='40' & $sh[$i-192]=='40' & $sh[$i-216]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи - ['.$i.']'; $shah='2'; }


                           }  // конец черная тура вверх






if($sh[$i]=='2')  {  // проверка черная тура вниз есть ли шах
                           if($sh[$i+24]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='40' & $sh[$i+192]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.']'; $shah='2'; }
               if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='40' & $sh[$i+192]=='40' & $sh[$i+216]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.']'; $shah='2'; }


                           }  // конец черная тура вниз









if($sh[$i]=='12')  {  // проверка белая тура влево есть ли шах
                           if($sh[$i-1]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' & $sh[$i-5]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='40' & $sh[$i-10]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='40' & $sh[$i-10]=='40' & $sh[$i-11]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }

                           }  // конец белая тура влево




if($sh[$i]=='12')  {  // проверка белая тура вправо есть ли шах
                           if($sh[$i+1]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' & $sh[$i+5]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='40' & $sh[$i+10]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='40' & $sh[$i+10]=='40' & $sh[$i+11]=='6')  {  $proverka=true; echo '<br>Шах черному королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }

                           }  // конец белая тура вправо






if($sh[$i]=='2')  {  // проверка черная тура влево есть ли шах
                           if($sh[$i-1]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' & $sh[$i-5]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='40' & $sh[$i-10]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='40' & $sh[$i-10]=='40' & $sh[$i-11]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }

                           }  // конец черная тура влево




if($sh[$i]=='2')  {  // проверка черная тура вправо есть ли шах
                           if($sh[$i+1]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' & $sh[$i+5]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='40' & $sh[$i+10]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='40' & $sh[$i+10]=='40' & $sh[$i+11]=='16')  {  $proverka=true; echo '<br>Шах белому королю от ладьи + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }

                           }  // конец черная тура вправо






                                  }  // цикл for

                        





if($hod_one<'1000' & $proverka==true) {

for($i=0;$i<300;$i++)  {  



//$sh_prov[$hod_two]=$sh_prov[$hod_one];   // экспериментально ходим, снят ли шах
if($sh_prov[$hod_one]<>'40') { $sh_prov[$hod_two]=$sh_prov[$hod_one]; $sh_prov[$hod_one]='40'; }  // экспериментально ходим, снят ли шах




if($sh_prov[$i]=='12')  {  // проверка белая тура вверх есть ли шах
                           if($sh_prov[$i-24]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
               if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='40' & $sh_prov[$i-216]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }


                           }  // конец белая тура вверх






if($sh_prov[$i]=='12')  {  // проверка белая тура вниз есть ли шах
                           if($sh_prov[$i+24]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
               if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='40' & $sh_prov[$i+216]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }


                           }  // конец белая тура вниз








if($sh_prov[$i]=='2')  {  // проверка черная тура вверх есть ли шах
                           if($sh_prov[$i-24]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
               if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='40' & $sh_prov[$i-216]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }


                           }  // конец черная тура вверх






if($sh_prov[$i]=='2')  {  // проверка черная тура вниз есть ли шах
                           if($sh_prov[$i+24]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
               if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='40' & $sh_prov[$i+216]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }


                           }  // конец черная тура вниз











if($sh_prov[$i]=='12')  {  // проверка белая тура влево есть ли шах
                           if($sh_prov[$i-1]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' & $sh_prov[$i-5]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='40' & $sh_prov[$i-11]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }

                           }  // конец белая тура влево




if($sh_prov[$i]=='12')  {  // проверка белая тура вправо есть ли шах
                           if($sh_prov[$i+1]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' & $sh_prov[$i+5]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='40' & $sh_prov[$i+11]=='6')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }

                           }  // конец белая тура вправо






if($sh_prov[$i]=='2')  {  // проверка черная тура влево есть ли шах
                           if($sh_prov[$i-1]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' & $sh_prov[$i-5]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='40' & $sh_prov[$i-11]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }

                           }  // конец черная тура влево




if($sh_prov[$i]=='2')  {  // проверка черная тура вправо есть ли шах
                           if($sh_prov[$i+1]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' & $sh_prov[$i+5]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='40' & $sh_prov[$i+11]=='16')  {  echo '<br>Шах не снят от ладьи - ['.$i.'], <font size=1><strong>( Разрешаю ход,может ошибка )</strong></font>';  $hod_one='1000'; $hod_two='1000';  $hod_one='1000'; $hod_two='1000';  }

                           }  // конец черная тура вправо








// echo '&nbsp;&nbsp;&nbsp;$sh_prov['.$i.'] = '.$sh_prov[$i];

                                   }

                          }


?>