<?

for($i=0;$i<300;$i++)  {  

$sh_prov[$i]=$sh[$i];

 // echo '&nbsp;&nbsp;&nbsp;$sh['.$i.'] = '.$sh[$i];

if($sh[$i]=='13')  {
                           if($sh[$i-26]=='6' | $sh[$i+26]=='6' | $sh[$i-22]=='6' | $sh[$i+22]=='6' | $sh[$i+47]=='6' | $sh[$i-47]=='6' | $sh[$i-49]=='6' | $sh[$i+49]=='6')  {  echo '<br>Шах черному королю - ['.$i.']'; $proverka=true; $shah='1'; }
                           }


if($sh[$i]=='3')  {
                           if($sh[$i-26]=='16' | $sh[$i+26]=='16' | $sh[$i-22]=='16' | $sh[$i+22]=='16' | $sh[$i+47]=='16' | $sh[$i-47]=='16' | $sh[$i-49]=='16' | $sh[$i+49]=='16')  {  echo '<br>Шах белому королю - ['.$i.']'; $proverka=true; $shah='2';  }
                           }



                                   


     if($sh[$i]=='11')  {
                           if($sh[$i-25]=='6' | $sh[$i-23]=='6')  {  echo '<br>Шах черному королю - ['.$i.']'; $proverka=true; $shah='1';  }
                           }
                              

     if($sh[$i]=='1')  {
                           if($sh[$i+25]=='16' | $sh[$i+23]=='16')  {  echo '<br>Шах белому королю - ['.$i.']'; $proverka=true; $shah='2';  }
                           }
                              

                                   







if($sh[$i]=='17')  {
                           if($sh[$i-75]=='6' | $sh[$i+75]=='6' | $sh[$i-69]=='6' | $sh[$i+69]=='6' | $sh[$i+2]=='6' | $sh[$i-2]=='6' | $sh[$i-3]=='6' | $sh[$i+3]=='6' |
$sh[$i-48]=='6' | $sh[$i+48]=='6' | $sh[$i-72]=='6' | $sh[$i+72]=='6' | $sh[$i+50]=='6' | $sh[$i-50]=='6' | $sh[$i-46]=='6' | $sh[$i+46]=='6')  {  echo '<br>Шах от ястреба - ['.$i.']'; $proverka=true;  $shah='1';  }
                           }


if($sh[$i]=='7')  {
       if($sh[$i-75]=='16' | $sh[$i+75]=='16' | $sh[$i-69]=='16' | $sh[$i+69]=='16' | $sh[$i+2]=='16' | $sh[$i-2]=='16' | $sh[$i-3]=='16' | $sh[$i+3]=='16' |
$sh[$i-48]=='16' | $sh[$i+48]=='16' | $sh[$i-72]=='16' | $sh[$i+72]=='16' | $sh[$i+50]=='16' | $sh[$i-50]=='16' | $sh[$i-46]=='16' | $sh[$i+46]=='16')  {  echo '<br>Шах от ястреба - ['.$i.']'; $proverka=true; $shah='2';   }
                        
                           }

if($sh[$i]=='18')  {
       if($sh[$i-48]=='6' || $sh[$i+48]=='6' || $sh[$i+2]=='6' || $sh[$i-2]=='6' || $sh[$i-26]=='6' || $sh[$i+26]=='6' || $sh[$i-49]=='6' || $sh[$i+49]=='6'
 || $sh[$i-50]=='6' || $sh[$i+50]=='6' || $sh[$i-22]=='6' || $sh[$i+22]=='6'
 || $sh[$i-47]=='6' || $sh[$i+47]=='6' || $sh[$i-46]=='6' || $sh[$i+46]=='6')  {  echo '<br>Шах от медведя - ['.$i.']'; $proverka=true; $shah='1';   }
                                              }


if($sh[$i]=='8')  {
       if($sh[$i-48]=='16' || $sh[$i+48]=='16' || $sh[$i+2]=='16' || $sh[$i-2]=='16' || $sh[$i-26]=='16' || $sh[$i+26]=='16' || $sh[$i-49]=='16' || $sh[$i+49]=='16'
 || $sh[$i-50]=='16' || $sh[$i+50]=='16' || $sh[$i-47]=='16' || $sh[$i+47]=='16'
 || $sh[$i-22]=='16' || $sh[$i+22]=='16' || $sh[$i-46]=='16' || $sh[$i+46]=='16')  {  echo '<br>Шах от медведя - ['.$i.']'; $proverka=true;  $shah='2';  }
                        
                           }


if($sh[$i]=='19')  {
       if($sh[$i-1]=='6' || $sh[$i+1]=='6' || $sh[$i+24]=='6' || $sh[$i-24]=='6' || $sh[$i-23]=='6' || $sh[$i+23]=='6' || $sh[$i-25]=='6' || $sh[$i+25]=='6')  {  echo '<br>Шах от призрака - ['.$i.']'; $proverka=true;  $shah='1';  }
                                              }


if($sh[$i]=='9')  {
       if($sh[$i-1]=='16' | $sh[$i+1]=='16' | $sh[$i+24]=='16' | $sh[$i-24]=='16' | $sh[$i-23]=='16' | $sh[$i+23]=='16' | $sh[$i-25]=='16' | $sh[$i+25]=='16')  {  echo '<br>Шах от призрака - ['.$i.']'; $proverka=true;  $shah='2';  }
                        
                           }














                                  }  // цикл for

                        





if($hod_one<'1000' & $proverka==true) {

for($i=0;$i<300;$i++)  {  



//$sh_prov[$hod_two]=$sh_prov[$hod_one];   // экспериментально ходим, снят ли шах
if($sh_prov[$hod_one]<>'40') { $sh_prov[$hod_two]=$sh_prov[$hod_one]; $sh_prov[$hod_one]='40'; }  // экспериментально ходим, снят ли шах




if($sh_prov[$i]=='13')  {
                           if($sh_prov[$i-26]=='6' | $sh_prov[$i+26]=='6' | $sh_prov[$i-22]=='6' | $sh_prov[$i+22]=='6' | $sh_prov[$i+47]=='6' | $sh_prov[$i-47]=='6' | $sh_prov[$i-49]=='6' | $sh_prov[$i+49]=='6')  {  echo '<br>Шах не снят от коня - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           }


if($sh_prov[$i]=='3')  {
                           if($sh_prov[$i-26]=='16' | $sh_prov[$i+26]=='16' | $sh_prov[$i-22]=='16' | $sh_prov[$i+22]=='16' | $sh_prov[$i+47]=='16' | $sh_prov[$i-47]=='16' | $sh_prov[$i-49]=='16' | $sh_prov[$i+49]=='16')  {  echo '<br>Шах не снят от коня - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           }







     if($sh_prov[$i]=='11')  {
                           if($sh_prov[$i-25]=='6' | $sh_prov[$i-23]=='6')  {  echo '<br>Шах не снят от пешки - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           }
                              

     if($sh_prov[$i]=='1')  {
                           if($sh_prov[$i+25]=='16' | $sh_prov[$i+23]=='16')  {  echo '<br>Шах не снят от пешки - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           }
                              






if($sh_prov[$i]=='17')  {
                           if($sh_prov[$i-75]=='6' | $sh_prov[$i+75]=='6' | $sh_prov[$i-69]=='6' | $sh_prov[$i+69]=='6' | $sh_prov[$i+2]=='6' | $sh_prov[$i-2]=='6' | $sh_prov[$i-3]=='6' | $sh_prov[$i+3]=='6' |
$sh_prov[$i-48]=='6' | $sh_prov[$i+48]=='6' | $sh_prov[$i-72]=='6' | $sh_prov[$i+72]=='6' | $sh_prov[$i+50]=='6' | $sh_prov[$i-50]=='6' | $sh_prov[$i-46]=='6' | $sh_prov[$i+46]=='6')  {  echo '<br>Шах не снят от ястреба - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           }


if($sh_prov[$i]=='7')  {
       if($sh_prov[$i-75]=='16' | $sh_prov[$i+75]=='16' | $sh_prov[$i-69]=='16' | $sh_prov[$i+69]=='16' | $sh_prov[$i+2]=='16' | $sh_prov[$i-2]=='16' | $sh_prov[$i-3]=='16' | $sh_prov[$i+3]=='16' |
$sh_prov[$i-48]=='16' | $sh_prov[$i+48]=='16' | $sh_prov[$i-72]=='16' | $sh_prov[$i+72]=='16' | $sh_prov[$i+50]=='16' | $sh_prov[$i-50]=='16' | $sh_prov[$i-46]=='16' | $sh_prov[$i+46]=='16')  {  echo '<br>Шах не снят от ястреба - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                        
                           }

if($sh_prov[$i]=='18')  {
       if($sh_prov[$i-48]=='6' | $sh_prov[$i+48]=='6' | $sh_prov[$i+2]=='6' | $sh_prov[$i-2]=='6' | $sh_prov[$i-26]=='6' | $sh_prov[$i+26]=='6' | $sh_prov[$i-49]=='6' | $sh_prov[$i+49]=='6'
 | $sh_prov[$i-50]=='6' | $sh_prov[$i+50]=='6' | $sh_prov[$i-47]=='6' | $sh_prov[$i+47]=='6'
 | $sh_prov[$i-22]=='6' | $sh_prov[$i+22]=='6' | $sh_prov[$i-46]=='6' | $sh_prov[$i+46]=='6')  {  echo '<br>Шах не снят от медведя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                                              }

 
if($sh_prov[$i]=='8')  {
       if($sh_prov[$i-48]=='16' | $sh_prov[$i+48]=='16' | $sh_prov[$i+2]=='16' | $sh_prov[$i-2]=='16' | $sh_prov[$i-26]=='16' | $sh_prov[$i+26]=='16' | $sh_prov[$i-49]=='16' | $sh_prov[$i+49]=='16'
 | $sh_prov[$i-50]=='16' | $sh_prov[$i+50]=='16' | $sh_prov[$i-47]=='16' | $sh_prov[$i+47]=='16'
 | $sh_prov[$i-22]=='16' | $sh_prov[$i+22]=='16' | $sh_prov[$i-46]=='16' | $sh_prov[$i+46]=='16')  {  echo '<br>Шах не снят от медведя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                        
                           }


if($sh_prov[$i]=='19')  {
       if($sh_prov[$i-1]=='6' | $sh_prov[$i+1]=='6' | $sh_prov[$i+24]=='6' | $sh_prov[$i-24]=='6' | $sh_prov[$i-25]=='6' | $sh_prov[$i+25]=='6' | $sh_prov[$i-23]=='6' | $sh_prov[$i+23]=='6')  {  echo '<br>Шах не снят от призрака - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                                              }


if($sh_prov[$i]=='9')  {
       if($sh_prov[$i-1]=='16' | $sh_prov[$i+1]=='16' | $sh_prov[$i+24]=='16' | $sh_prov[$i-24]=='16' | $sh_prov[$i-25]=='16' | $sh_prov[$i+25]=='16' | $sh_prov[$i-23]=='16' | $sh_prov[$i+23]=='16')  {  echo '<br>Шах не снят от призрака - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                        
                           }




              



// echo '&nbsp;&nbsp;&nbsp;$sh_prov['.$i.'] = '.$sh_prov[$i];

                                   }

                          }


?>