<? 

// echo 'Пишу про ход про открытие шаха<br>';
// echo '$dostup = '.$dostup.'<br>';

if($hod_one<'1000') {

for($i=0;$i<300;$i++)  {  $sh_prov[$i]=$sh[$i]; }

for($i=0;$i<300;$i++)  {  

 //$sh_prov[$hod_two]=$sh_prov[$hod_one];   // экспериментально ходим, снят ли шах
  if($sh_prov[$hod_one]<'40') { $k='1'; $sh_prov[$hod_two]=$sh_prov[$hod_one]; $sh_prov[$hod_one]='40';  }

// ниже обработка коня

if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='13')  {
                           if($sh_prov[$i-26]=='6' | $sh_prov[$i+26]=='6' | $sh_prov[$i-22]=='6' | $sh_prov[$i+22]=='6' | $sh_prov[$i+47]=='6' | $sh_prov[$i-47]=='6' | $sh_prov[$i-49]=='6' | $sh_prov[$i+49]=='6')  {  echo '<br>Ход открывает шах от коня - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           }
                         }

if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='3')  {
                           if($sh_prov[$i-26]=='16' | $sh_prov[$i+26]=='16' | $sh_prov[$i-22]=='16' | $sh_prov[$i+22]=='16' | $sh_prov[$i+47]=='16' | $sh_prov[$i-47]=='16' | $sh_prov[$i-49]=='16' | $sh_prov[$i+49]=='16')  {  echo '<br>Ход открывает шах от коня - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           }
                         }


if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='17')  {
                           if($sh_prov[$i-22]=='6' | $sh_prov[$i+22]=='6' | $sh_prov[$i-26]=='6' | $sh_prov[$i+26]=='6' |
 $sh_prov[$i+47]=='6' | $sh_prov[$i-47]=='6' | $sh_prov[$i-49]=='6' | $sh_prov[$i+49]=='6' |
 $sh_prov[$i+46]=='6' | $sh_prov[$i-46]=='6' | $sh_prov[$i-50]=='6' | $sh_prov[$i+50]=='6')  {  echo '<br>Ход открывает шах от insider - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           }
                         }

if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='7')  {
                           if($sh_prov[$i-22]=='16' | $sh_prov[$i+22]=='16' | $sh_prov[$i-26]=='16' | $sh_prov[$i+26]=='16' |
 $sh_prov[$i+47]=='16' | $sh_prov[$i-47]=='16' | $sh_prov[$i-49]=='16' | $sh_prov[$i+49]=='16' |
 $sh_prov[$i+46]=='16' | $sh_prov[$i-46]=='16' | $sh_prov[$i-50]=='16' | $sh_prov[$i+50]=='16')  {  echo '<br>Ход открывает шах от insider - ['.$i.']'; $hod_one='1000'; $hod_two='1000';  }
                           }
                         }





// ниже обработка пешки

if($hod_dostup=='2') {  // если играем на чужой доске черными
     if($sh_prov[$i]=='11')  {
                           if($sh_prov[$i-25]=='6' | $sh_prov[$i-23]=='6')  {  echo '<br>Ход открывает шах от пешки - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           }
                         }
                              
if($hod_dostup=='1') { // если играем своими белыми
    if($sh_prov[$i]=='1')  {
                           if($sh_prov[$i+25]=='16' | $sh_prov[$i+23]=='16')  {  echo '<br>Ход открывает шах от пешки - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           }
                          }    
                          


if($hod_dostup=='2') {  // если играем на чужой доске черными
     if($sh_prov[$i]=='19')  {
                           if($sh_prov[$i-22]=='6' | $sh_prov[$i-26]=='6' | $sh_prov[$i+22]=='6' | $sh_prov[$i+26]=='6' | $sh_prov[$i-47]=='6' | $sh_prov[$i-49]=='6' | $sh_prov[$i+47]=='6' | $sh_prov[$i+49]=='6'
 | $sh_prov[$i-2]=='6' | $sh_prov[$i-48]=='6' | $sh_prov[$i+2]=='6' | $sh_prov[$i+48]=='6')  {  echo '<br>Ход открывает шах от паука - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           }
                         }
                              
if($hod_dostup=='1') { // если играем своими белыми
    if($sh_prov[$i]=='9')  {
                           if($sh_prov[$i+22]=='16' | $sh_prov[$i+26]=='16' | $sh_prov[$i-22]=='16' | $sh_prov[$i-26]=='16' | $sh_prov[$i+47]=='16' | $sh_prov[$i+49]=='16' | $sh_prov[$i-47]=='16' | $sh_prov[$i-49]=='16'
 | $sh_prov[$i+2]=='16' | $sh_prov[$i+48]=='16' | $sh_prov[$i-2]=='16' | $sh_prov[$i-48]=='16')  {  echo '<br>Ход открывает шах от паука - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           }
                          }    
                          



if($hod_dostup=='2') {  // если играем на чужой доске черными
     if($sh_prov[$i]=='18')  {
                           if($sh_prov[$i+23]=='6' | $sh_prov[$i+25]=='6' | $sh_prov[$i-23]=='6' | $sh_prov[$i-25]=='6' | 
$sh_prov[$i+46]=='6' | $sh_prov[$i+50]=='6' | $sh_prov[$i-46]=='6' | $sh_prov[$i-50]=='6' | 
$sh_prov[$i+69]=='6' | $sh_prov[$i+75]=='6' | $sh_prov[$i-69]=='6' | $sh_prov[$i-75]=='6')  {  echo '<br>Ход открывает шах от гения - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                            }
                         }
                              
if($hod_dostup=='1') { // если играем своими белыми
    if($sh_prov[$i]=='8')  {
                           if($sh_prov[$i+23]=='16' | $sh_prov[$i+25]=='16' | $sh_prov[$i-23]=='16' | $sh_prov[$i-25]=='16' | 
$sh_prov[$i+46]=='16' | $sh_prov[$i+50]=='16' | $sh_prov[$i-46]=='16' | $sh_prov[$i-50]=='16' | 
$sh_prov[$i+69]=='16' | $sh_prov[$i+75]=='16' | $sh_prov[$i-69]=='16' | $sh_prov[$i-75]=='16')  {  echo '<br>Ход открывает шах от гения - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           }
                          }    
                          






// ниже обработка ладьи






if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='12')  {  // проверка белая тура вверх есть ли шах
                           if($sh_prov[$i-24]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
               if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='40' & $sh_prov[$i-216]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }


                           }  // конец белая тура вверх
                       }




if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='12')  {  // проверка белая тура вниз есть ли шах
                           if($sh_prov[$i+24]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
               if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='40' & $sh_prov[$i+216]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }


                           }  // конец белая тура вниз
                       }






if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='2')  {  // проверка черная тура вверх есть ли шах
                           if($sh_prov[$i-24]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }
               if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='40' & $sh_prov[$i-216]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1296'; $hod_two='1296';  }


                           }  // конец черная тура вверх
                       }




if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='2')  {  // проверка черная тура вниз есть ли шах
                           if($sh_prov[$i+24]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
               if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='40' & $sh_prov[$i+216]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }


                           }  // конец черная тура вниз
                       }









if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='12')  {  // проверка белая тура влево есть ли шах
                           if($sh_prov[$i-1]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' & $sh_prov[$i-5]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='40' & $sh_prov[$i-23]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }

                           }  // конец белая тура влево
                       }


if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='12')  {  // проверка белая тура вправо есть ли шах
                           if($sh_prov[$i+1]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' & $sh_prov[$i+5]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='40' & $sh_prov[$i+23]=='6')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }

                           }  // конец белая тура вправо
                       }




if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='2')  {  // проверка черная тура влево есть ли шах
                           if($sh_prov[$i-1]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' & $sh_prov[$i-5]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='40' & $sh_prov[$i-23]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }

                           }  // конец черная тура влево
                        }


if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='2')  {  // проверка черная тура вправо есть ли шах
                           if($sh_prov[$i+1]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' & $sh_prov[$i+5]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='40' & $sh_prov[$i+23]=='16')  {  echo '<br>Ход открывает шах от ладьи - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }

                           }  // конец черная тура вправо
                       }











// ниже обработка офицера









if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='14')  {  // проверка белый офицер вверх есть ли шах
                           if($sh_prov[$i-23]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='40' & $sh_prov[$i-207]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
               
            }  // конец белый офицер вверх
                      }



if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='14')  {  // проверка белый офицер вниз есть ли шах
                           if($sh_prov[$i+23]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='40' & $sh_prov[$i+207]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
               
            }  // конец белый офицер вниз
                       }





if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='14')  {  // проверка белый офицер вверх есть ли шах
                           if($sh_prov[$i-25]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='40' & $sh_prov[$i-225]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
               
            }  // конец белый офицер вверх
                      }



if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='14')  {  // проверка белый офицер вниз есть ли шах
                           if($sh_prov[$i+25]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='40' & $sh_prov[$i+225]=='6')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
               
            }  // конец белый офицер вниз
                      }









if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='4')  {  // проверка черный офицер вверх есть ли шах
                           if($sh_prov[$i-23]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='40' & $sh_prov[$i-207]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
               
            }  // конец черный офицер вверх
                        }



if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='4')  {  // проверка черный офицер вниз есть ли шах
                           if($sh_prov[$i+23]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='40' & $sh_prov[$i+207]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
               
            }  // конец черный офицер вниз
                         }





if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='4')  {  // проверка черный офицер вверх есть ли шах
                           if($sh_prov[$i-25]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='40' & $sh_prov[$i-225]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
               
            }  // конец черный офицер вверх
                       }



if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='4')  {  // проверка черный офицер вниз есть ли шах
                           if($sh_prov[$i+25]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='40' & $sh_prov[$i+225]=='16')  {  echo '<br>Ход открывает шах от слона - ['.$i.'],';  $hod_one='1000'; $hod_two='1000'; }
               
            }  // конец черный офицер вниз
                          }

















// ниже обработка ферзя







if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='15')  {  // проверка белый ферзь вверх есть ли шах
                           if($sh_prov[$i-24]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
               if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='40' & $sh_prov[$i-216]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }


                           }  // конец белый ферзь вверх
                     }




if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='15')  {  // проверка белый ферзь вниз есть ли шах
                           if($sh_prov[$i+24]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
               if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='40' & $sh_prov[$i+216]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }


                           }  // конец белый ферзь вниз
                       }






if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='5')  {  // проверка черный ферзь вверх есть ли шах
                           if($sh_prov[$i-24]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }
               if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='40' & $sh_prov[$i-216]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';    }


                           }  // конец черный ферзь вверх
                      }




if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='5')  {  // проверка черный ферзь вниз есть ли шах
                           if($sh_prov[$i+24]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }
               if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='40' & $sh_prov[$i+216]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';   }


                           }  // конец черный ферзь вниз
                      }









if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='15')  {  // проверка белый ферзь влево есть ли шах
                           if($sh_prov[$i-1]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' & $sh_prov[$i-5]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='40' & $sh_prov[$i-23]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }

                           }  // конец белый ферзь влево
                       }


if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='15')  {  // проверка белый ферзь вправо есть ли шах
                           if($sh_prov[$i+1]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' & $sh_prov[$i+5]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='40' & $sh_prov[$i+23]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }

                           }  // конец белый ферзь вправо
                       }



// ниже =='5' и $i+1  $i-1 исправить
 
if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='5')  {  // проверка черный ферзь влево есть ли шах
                           if($sh_prov[$i-1]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' & $sh_prov[$i-5]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='40' & $sh_prov[$i-23]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }

                           }  // конец черный ферзь влево
                      }


if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='5')  {  // проверка черный ферзь вправо есть ли шах

                           if($sh_prov[$i+1]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' & $sh_prov[$i+5]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='40' & $sh_prov[$i+23]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }

                           }  // конец черный ферзь вправо
                      }

// выше =='5' и $i+1  $i-1 исправить
 









// выше проверка ферзя на мат по перпендикуляру

// ниже крест накрест















if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='15')  {  // проверка белый ферзь вверх есть ли шах
                           if($sh_prov[$i-23]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='40' & $sh_prov[$i-207]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
               
            }  // конец белый ферзь вверх
                      }



if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='15')  {  // проверка белый ферзь вниз есть ли шах
                           if($sh_prov[$i+23]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='40' & $sh_prov[$i+207]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
               
            }  // конец белый ферзь вниз
                      }





if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='15')  {  // проверка белый ферзь вверх есть ли шах
                           if($sh_prov[$i-25]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='40' & $sh_prov[$i-216]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
               
            }  // конец белый ферзь вверх
                      }



if($hod_dostup=='2') { // если играем на чужой доске черными
if($sh_prov[$i]=='15')  {  // проверка белый ферзь вниз есть ли шах
                           if($sh_prov[$i+25]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='40' & $sh_prov[$i+216]=='6')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
               
            }  // конец белый ферзь вниз
                       }









if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='5')  {  // проверка черный ферзь вверх есть ли шах
                           if($sh_prov[$i-23]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='40' & $sh_prov[$i-207]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
               
            }  // конец черный ферзь вверх
                        }



if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='5')  {  // проверка черный ферзь вниз есть ли шах
                           if($sh_prov[$i+23]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='40' & $sh_prov[$i+207]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
               
            }  // конец черный ферзь вниз
                       }





if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='5')  {  // проверка черный ферзь вверх есть ли шах
                           if($sh_prov[$i-25]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='40' & $sh_prov[$i-216]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
               
            }  // конец черный ферзь вверх
                         }



if($hod_dostup=='1') { // если играем своими белыми
if($sh_prov[$i]=='5')  {  // проверка черный ферзь вниз есть ли шах
                           if($sh_prov[$i+25]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='40' & $sh_prov[$i+216]=='16')  {  echo '<br>Ход открывает шах от ферзя - ['.$i.'],'; $hod_one='1000'; $hod_two='1000';   }
               
            }  // конец черный ферзь вниз
                         }
















// echo '&nbsp;&nbsp;&nbsp;$sh_prov['.$i.'] = '.$sh_prov[$i];

                                   }

                          }


?>