<?php

$tt=$index; unset($dona_x); $tt_one=$index;

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

//if($sh[$tt+23]=='1') { $dona_x='1'; }
//if($sh[$tt+25]=='1') { $dona_x='1'; }
}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

//if($sh[$tt-23]=='11') { $dona_x='1'; }
//if($sh[$tt-25]=='11') { $dona_x='1'; }
}}





                                          




if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+22]=='3') { $dona_x='3'; }
if($sh[$tt+26]=='3') { $dona_x='3'; }
if($sh[$tt-22]=='3') { $dona_x='3'; }
if($sh[$tt-26]=='3') { $dona_x='3'; }

if($sh[$tt+47]=='3') { $dona_x='3'; }
if($sh[$tt+49]=='3') { $dona_x='3'; }
if($sh[$tt-47]=='3') { $dona_x='3'; }
if($sh[$tt-49]=='3') { $dona_x='3'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-22]=='13') { $dona_x='3'; }
if($sh[$tt-26]=='13') { $dona_x='3'; }
if($sh[$tt+22]=='13') { $dona_x='3'; }
if($sh[$tt+26]=='13') { $dona_x='3'; }

if($sh[$tt-47]=='13') { $dona_x='3'; }
if($sh[$tt-49]=='13') { $dona_x='3'; }
if($sh[$tt+47]=='13') { $dona_x='3'; }
if($sh[$tt+49]=='13') { $dona_x='3'; }

}}











if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='4') { $dona_x='4'; }
if($sh[$tt+25]=='4') { $dona_x='4'; }
if($sh[$tt-23]=='4') { $dona_x='4'; }
if($sh[$tt-25]=='4') { $dona_x='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='14') { $dona_x='4'; }
if($sh[$tt-25]=='14') { $dona_x='4'; }
if($sh[$tt+23]=='14') { $dona_x='4'; }
if($sh[$tt+25]=='14') { $dona_x='4'; }

}}







                                          




if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='2') { $dona_x='2'; }
if($sh[$tt+24]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='2') { $dona_x='2'; }
if($sh[$tt-24]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='12') { $dona_x='2'; }
if($sh[$tt-24]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='12') { $dona_x='2'; }
if($sh[$tt+24]=='12') { $dona_x='2'; }

}}











                                          




if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='5') { $dona_x='5'; }
if($sh[$tt+24]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='5') { $dona_x='5'; }
if($sh[$tt-24]=='5') { $dona_x='5'; }

if($sh[$tt+23]=='5') { $dona_x='5'; }
if($sh[$tt+25]=='5') { $dona_x='5'; }
if($sh[$tt-23]=='5') { $dona_x='5'; }
if($sh[$tt-25]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='15') { $dona_x='5'; }
if($sh[$tt-24]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='15') { $dona_x='5'; }
if($sh[$tt+24]=='15') { $dona_x='5'; }

if($sh[$tt-23]=='15') { $dona_x='5'; }
if($sh[$tt-25]=='15') { $dona_x='5'; }
if($sh[$tt+23]=='15') { $dona_x='5'; }
if($sh[$tt+25]=='15') { $dona_x='5'; }

}}







   


      

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+22]=='9') { $dona_x='9'; }
if($sh[$tt+26]=='9') { $dona_x='9'; }
if($sh[$tt-22]=='9') { $dona_x='9'; }
if($sh[$tt-26]=='9') { $dona_x='9'; }

if($sh[$tt+47]=='9') { $dona_x='9'; }
if($sh[$tt+49]=='9') { $dona_x='9'; }
if($sh[$tt-47]=='9') { $dona_x='9'; }
if($sh[$tt-49]=='9') { $dona_x='9'; }

if($sh[$tt+2]=='9') { $dona_x='9'; }
if($sh[$tt+48]=='9') { $dona_x='9'; }
if($sh[$tt-2]=='9') { $dona_x='9'; }
if($sh[$tt-48]=='9') { $dona_x='9'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-22]=='19') { $dona_x='9'; }
if($sh[$tt-26]=='19') { $dona_x='9'; }
if($sh[$tt+22]=='19') { $dona_x='9'; }
if($sh[$tt+26]=='19') { $dona_x='9'; }

if($sh[$tt-47]=='19') { $dona_x='9'; }
if($sh[$tt-49]=='19') { $dona_x='9'; }
if($sh[$tt+47]=='19') { $dona_x='9'; }
if($sh[$tt+49]=='19') { $dona_x='9'; }

if($sh[$tt-2]=='19') { $dona_x='9'; }
if($sh[$tt-48]=='19') { $dona_x='9'; }
if($sh[$tt+2]=='19') { $dona_x='9'; }
if($sh[$tt+48]=='19') { $dona_x='9'; }

}}




                                          




if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='8') { $dona_x='8'; }
if($sh[$tt+25]=='8') { $dona_x='8'; }
if($sh[$tt-23]=='8') { $dona_x='8'; }
if($sh[$tt-25]=='8') { $dona_x='8'; }

if($sh[$tt+46]=='8') { $dona_x='8'; }
if($sh[$tt+50]=='8') { $dona_x='8'; }
if($sh[$tt-46]=='8') { $dona_x='8'; }
if($sh[$tt-50]=='8') { $dona_x='8'; }

if($sh[$tt+69]=='8') { $dona_x='8'; }
if($sh[$tt+75]=='8') { $dona_x='8'; }
if($sh[$tt-69]=='8') { $dona_x='8'; }
if($sh[$tt-75]=='8') { $dona_x='8'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='18') { $dona_x='8'; }
if($sh[$tt-25]=='18') { $dona_x='8'; }
if($sh[$tt+23]=='18') { $dona_x='8'; }
if($sh[$tt+25]=='18') { $dona_x='8'; }

if($sh[$tt-46]=='18') { $dona_x='8'; }
if($sh[$tt-50]=='18') { $dona_x='8'; }
if($sh[$tt+46]=='18') { $dona_x='8'; }
if($sh[$tt+50]=='18') { $dona_x='8'; }

if($sh[$tt-69]=='18') { $dona_x='8'; }
if($sh[$tt-75]=='18') { $dona_x='8'; }
if($sh[$tt+69]=='18') { $dona_x='8'; }
if($sh[$tt+75]=='18') { $dona_x='8'; }

}}











                                          




if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+22]=='7') { $dona_x='7'; }
if($sh[$tt+26]=='7') { $dona_x='7'; }
if($sh[$tt-22]=='7') { $dona_x='7'; }
if($sh[$tt-26]=='7') { $dona_x='7'; }

if($sh[$tt+47]=='7') { $dona_x='7'; }
if($sh[$tt+49]=='7') { $dona_x='7'; }
if($sh[$tt-47]=='7') { $dona_x='7'; }
if($sh[$tt-49]=='7') { $dona_x='7'; }

if($sh[$tt+46]=='7') { $dona_x='7'; }
if($sh[$tt+50]=='7') { $dona_x='7'; }
if($sh[$tt-46]=='7') { $dona_x='7'; }
if($sh[$tt-50]=='7') { $dona_x='7'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-22]=='17') { $dona_x='7'; }
if($sh[$tt-26]=='17') { $dona_x='7'; }
if($sh[$tt+22]=='17') { $dona_x='7'; }
if($sh[$tt+26]=='17') { $dona_x='7'; }

if($sh[$tt-47]=='17') { $dona_x='7'; }
if($sh[$tt-49]=='17') { $dona_x='7'; }
if($sh[$tt+47]=='17') { $dona_x='7'; }
if($sh[$tt+49]=='17') { $dona_x='7'; }

if($sh[$tt-46]=='17') { $dona_x='7'; }
if($sh[$tt-50]=='17') { $dona_x='7'; }
if($sh[$tt+46]=='17') { $dona_x='7'; }
if($sh[$tt+50]=='17') { $dona_x='7'; }

}}











// ниже проверка через 1 клетку

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='5') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='5') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='5') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='5') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='5') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='5') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='15') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='15') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='15') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='15') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='15') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='15') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='15') { $dona_x='5'; }

}}









// ниже проверка через 2 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='5') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='5') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='5') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='5') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='5') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='5') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='15') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='15') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='15') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='15') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='15') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='15') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='15') { $dona_x='5'; }

}}








// ниже проверка через 3 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='5') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='5') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='5') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='5') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='5') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='5') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='15') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='15') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='15') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='15') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='15') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='15') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='15') { $dona_x='5'; }

}}








// ниже проверка через 4 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='5') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='5') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='5') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='5') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='5') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='5') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='15') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='15') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='15') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='15') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='15') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='15') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='15') { $dona_x='5'; }

}}







// ниже проверка через 5 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='5') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='40' && $sh[$tt+144]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='5') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='40' && $sh[$tt-144]=='5') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='5') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='5') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='5') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='15') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='40' && $sh[$tt-144]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='15') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='40' && $sh[$tt+144]=='15') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='15') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='15') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='15') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='15') { $dona_x='5'; }

}}







// ниже проверка через 6 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='5') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='40' && $sh[$tt+144]=='40' && $sh[$tt+168]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='5') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='40' && $sh[$tt+144]=='40' && $sh[$tt-168]=='5') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='40' && $sh[$tt+161]=='5') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='40' && $sh[$tt+175]=='5') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='40' && $sh[$tt-161]=='5') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='40' && $sh[$tt-175]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='15') { $dona_x='5'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='40' && $sh[$tt-144]=='40' && $sh[$tt-168]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='15') { $dona_x='5'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='40' && $sh[$tt+144]=='40' && $sh[$tt+168]=='15') { $dona_x='5'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='40' && $sh[$tt-161]=='15') { $dona_x='5'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='40' && $sh[$tt-175]=='15') { $dona_x='5'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='40' && $sh[$tt+161]=='15') { $dona_x='5'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='40' && $sh[$tt+175]=='15') { $dona_x='5'; }

}}







// ниже проверка через 7 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='15') { $dona_x='5'; }

}}








// ниже проверка через 8 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='15') { $dona_x='5'; }

}}







// ниже проверка через 9 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='40' && $sh[$tt+10]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='40' && $sh[$tt-10]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='40' && $sh[$tt-10]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='40' && $sh[$tt+10]=='15') { $dona_x='5'; }

}}







// ниже проверка через 10 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='40' && $sh[$tt+10]=='40' && $sh[$tt+11]=='5') { $dona_x='5'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='40' && $sh[$tt-10]=='40' && $sh[$tt-11]=='5') { $dona_x='5'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='40' && $sh[$tt-10]=='40' && $sh[$tt-11]=='15') { $dona_x='5'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='40' && $sh[$tt+10]=='40' && $sh[$tt+11]=='15') { $dona_x='5'; }

}}








//ниже ладья
// ниже проверка через 1 клетку

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='2') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='2') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='12') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='12') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='12') { $dona_x='2'; }

}}









// ниже проверка через 2 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='2') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='2') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='12') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='12') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='12') { $dona_x='2'; }

}}








// ниже проверка через 3 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='2') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='2') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='12') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='12') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='12') { $dona_x='2'; }

}}








// ниже проверка через 4 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='2') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='2') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='12') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='12') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='12') { $dona_x='2'; }

}}







// ниже проверка через 5 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='2') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='40' && $sh[$tt+144]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='2') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='40' && $sh[$tt-144]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='12') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='40' && $sh[$tt-144]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='12') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='40' && $sh[$tt+144]=='12') { $dona_x='2'; }

}}







// ниже проверка через 6 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='2') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='40' && $sh[$tt+144]=='40' && $sh[$tt+168]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='2') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='40' && $sh[$tt+144]=='40' && $sh[$tt-168]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='12') { $dona_x='2'; }
if($sh[$tt-24]=='40' && $sh[$tt-48]=='40' && $sh[$tt-72]=='40' && $sh[$tt-96]=='40' && $sh[$tt-120]=='40' && $sh[$tt-144]=='40' && $sh[$tt-168]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='12') { $dona_x='2'; }
if($sh[$tt+24]=='40' && $sh[$tt+48]=='40' && $sh[$tt+72]=='40' && $sh[$tt+96]=='40' && $sh[$tt+120]=='40' && $sh[$tt+144]=='40' && $sh[$tt+168]=='12') { $dona_x='2'; }

}}







// ниже проверка через 7 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='12') { $dona_x='2'; }

}}








// ниже проверка через 8 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='12') { $dona_x='2'; }

}}







// ниже проверка через 9 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='40' && $sh[$tt+10]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='40' && $sh[$tt-10]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='40' && $sh[$tt-10]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='40' && $sh[$tt+10]=='12') { $dona_x='2'; }

}}







// ниже проверка через 10 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='40' && $sh[$tt+10]=='40' && $sh[$tt+11]=='2') { $dona_x='2'; }
if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='40' && $sh[$tt-10]=='40' && $sh[$tt-11]=='2') { $dona_x='2'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-1]=='40' && $sh[$tt-2]=='40' && $sh[$tt-3]=='40' && $sh[$tt-4]=='40' && $sh[$tt-5]=='40' && $sh[$tt-6]=='40' && $sh[$tt-7]=='40' && $sh[$tt-8]=='40' && $sh[$tt-9]=='40' && $sh[$tt-10]=='40' && $sh[$tt-11]=='12') { $dona_x='2'; }
if($sh[$tt+1]=='40' && $sh[$tt+2]=='40' && $sh[$tt+3]=='40' && $sh[$tt+4]=='40' && $sh[$tt+5]=='40' && $sh[$tt+6]=='40' && $sh[$tt+7]=='40' && $sh[$tt+8]=='40' && $sh[$tt+9]=='40' && $sh[$tt+10]=='40' && $sh[$tt+11]=='12') { $dona_x='2'; }

}}








// ниже слон
// ниже проверка через 1 клетку

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='4') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='4') { $dona_x='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='4') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='4') { $dona_x='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='14') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='14') { $dona_x='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='14') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='14') { $dona_x='4'; }

}}









// ниже проверка через 2 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='4') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='4') { $dona_x='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='4') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='4') { $dona_x='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='14') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='14') { $dona_x='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='14') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='14') { $dona_x='4'; }

}}








// ниже проверка через 3 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='4') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='4') { $dona_x='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='4') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='4') { $dona_x='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='14') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='14') { $dona_x='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='14') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='14') { $dona_x='4'; }

}}








// ниже проверка через 4 клетки

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='4') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='4') { $dona_x='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='4') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='4') { $dona_x='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='14') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='14') { $dona_x='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='14') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='14') { $dona_x='4'; }

}}







// ниже проверка через 5 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='4') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='4') { $dona_x='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='4') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='4') { $dona_x='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='14') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='14') { $dona_x='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='14') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='14') { $dona_x='4'; }

}}







// ниже проверка через 6 клеток

if($sh[$tt_one]=='3' || $sh[$tt_one]=='1' || $sh[$tt_one]=='2' || $sh[$tt_one]=='4' || $sh[$tt_one]=='5' || $sh[$tt_one]=='7' || $sh[$tt_one]=='8' || $sh[$tt_one]=='9') {


if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='40' && $sh[$tt+161]=='4') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='40' && $sh[$tt+175]=='4') { $dona_x='4'; }
if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='40' && $sh[$tt-161]=='4') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='40' && $sh[$tt-175]=='4') { $dona_x='4'; }

}}


if($sh[$tt_one]=='13' || $sh[$tt_one]=='11' || $sh[$tt_one]=='12' || $sh[$tt_one]=='14' || $sh[$tt_one]=='15' || $sh[$tt_one]=='17' || $sh[$tt_one]=='18' || $sh[$tt_one]=='19') {


if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt-23]=='40' && $sh[$tt-46]=='40' && $sh[$tt-69]=='40' && $sh[$tt-92]=='40' && $sh[$tt-115]=='40' && $sh[$tt-138]=='40' && $sh[$tt-161]=='14') { $dona_x='4'; }
if($sh[$tt-25]=='40' && $sh[$tt-50]=='40' && $sh[$tt-75]=='40' && $sh[$tt-100]=='40' && $sh[$tt-125]=='40' && $sh[$tt-150]=='40' && $sh[$tt-175]=='14') { $dona_x='4'; }
if($sh[$tt+23]=='40' && $sh[$tt+46]=='40' && $sh[$tt+69]=='40' && $sh[$tt+92]=='40' && $sh[$tt+115]=='40' && $sh[$tt+138]=='40' && $sh[$tt+161]=='14') { $dona_x='4'; }
if($sh[$tt+25]=='40' && $sh[$tt+50]=='40' && $sh[$tt+75]=='40' && $sh[$tt+100]=='40' && $sh[$tt+125]=='40' && $sh[$tt+150]=='40' && $sh[$tt+175]=='14') { $dona_x='4'; }

}}






if(!$shah) {                                         
                                        
if($dona_x=='1') { echo '<a href=#>Фигура защищена пешкой</a><br>'; }
if($dona_x=='3') { echo '<a href=#>Фигура защищена конем</a><br>'; }
if($dona_x=='4') { echo '<a href=#>Фигура защищена слоном</a><br>'; }
if($dona_x=='2') { echo '<a href=#>Фигура защищена ладьей</a><br>'; }
if($dona_x=='5') { echo '<a href=#>Фигура защищена ферзем</a><br>'; }
if($dona_x=='9') { echo '<a href=#>Фигура защищена пауком</a><br>'; }
if($dona_x=='8') { echo '<a href=#>Фигура защищена гением</a><br>'; }
if($dona_x=='7') { echo '<a href=#>Фигура защищена insider</a><br>'; }
if($dona_x=='6') { echo '<a href=#>Фигура защищена королем</a><br>'; }
if($dona_x) {  unset($index);  unset($index_k); }


                 }
?>