<?

  //echo '<br>';

for($i=0;$i<300;$i++)  {  

$sh_prov[$i]=$sh[$i];

  //echo '&nbsp;&nbsp;&nbsp;$sh['.$i.'] = '.$sh[$i];




if($sh[$i]=='15')  {  // проверка белый ферзь вверх есть ли шах
                           if($sh[$i-24]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.']'; $shah='1'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='40' & $sh[$i-192]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.']'; $shah='1'; }
               if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='40' & $sh[$i-192]=='40' & $sh[$i-216]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.']'; $shah='1'; }


                           }  // конец белый ферзь вверх






if($sh[$i]=='15')  {  // проверка белый ферзь вниз есть ли шах
                           if($sh[$i+24]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.']'; $shah='1'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='40' & $sh[$i+192]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.']'; $shah='1'; }
               if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='40' & $sh[$i+192]=='40' & $sh[$i+216]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.']'; $shah='1'; }


                           }  // конец белый ферзь вниз








if($sh[$i]=='5')  {  // проверка черный ферзь вверх есть ли шах
                           if($sh[$i-24]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.']'; $shah='2'; }
                           if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='40' & $sh[$i-192]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.']'; $shah='2'; }
               if($sh[$i-24]=='40' & $sh[$i-48]=='40' & $sh[$i-72]=='40' & $sh[$i-96]=='40' & $sh[$i-120]=='40' & $sh[$i-144]=='40' & $sh[$i-168]=='40' & $sh[$i-192]=='40' & $sh[$i-216]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.']'; $shah='2'; }


                           }  // конец черный ферзь вверх






if($sh[$i]=='5')  {  // проверка черный ферзь вниз есть ли шах
                           if($sh[$i+24]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.']'; $shah='2'; }
                           if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='40' & $sh[$i+192]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.']'; $shah='2'; }
               if($sh[$i+24]=='40' & $sh[$i+48]=='40' & $sh[$i+72]=='40' & $sh[$i+96]=='40' & $sh[$i+120]=='40' & $sh[$i+144]=='40' & $sh[$i+168]=='40' & $sh[$i+192]=='40' & $sh[$i+216]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.']'; $shah='2'; }


                           }  // конец черный ферзь вниз







if($sh[$i]=='15')  {  // проверка белый ферзь влево есть ли шах
                           if($sh[$i-1]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' & $sh[$i-5]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='40' & $sh[$i-10]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='40' & $sh[$i-10]=='40' & $sh[$i-23]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }

                           }  // конец белый ферзь влево




if($sh[$i]=='15')  {  // проверка белый ферзь вправо есть ли шах
                           if($sh[$i+1]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' & $sh[$i+5]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='40' & $sh[$i+10]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='40' & $sh[$i+10]=='40' & $sh[$i+23]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='1'; }

                           }  // конец белый ферзь вправо






if($sh[$i]=='5')  {  // проверка черный ферзь влево есть ли шах
                           if($sh[$i-1]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' & $sh[$i-5]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='40' & $sh[$i-10]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i-1]=='40' & $sh[$i-2]=='40' & $sh[$i-3]=='40' & $sh[$i-4]=='40' &  $sh[$i-5]=='40' & $sh[$i-6]=='40' & $sh[$i-7]=='40' & $sh[$i-8]=='40' & $sh[$i-9]=='40' & $sh[$i-10]=='40' & $sh[$i-23]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }

                           }  // конец черный ферзь влево




if($sh[$i]=='5')  {  // проверка черный ферзь вправо есть ли шах

                           if($sh[$i+1]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' & $sh[$i+5]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='40' & $sh[$i+10]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }
                           if($sh[$i+1]=='40' & $sh[$i+2]=='40' & $sh[$i+3]=='40' & $sh[$i+4]=='40' &  $sh[$i+5]=='40' & $sh[$i+6]=='40' & $sh[$i+7]=='40' & $sh[$i+8]=='40' & $sh[$i+9]=='40' & $sh[$i+10]=='40' & $sh[$i+23]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя + ['.$i.'], <font size=1><strong>( Возможно ошибка )</strong></font>'; $shah='2'; }

                           }  // конец черный ферзь вправо



// выше ферзь по перпендикуляру

// ниже крест накрест













if($sh[$i]=='15')  {  // проверка белый ферзь вверх есть ли шах
                           if($sh[$i-23]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='40' & $sh[$i-138]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='40' & $sh[$i-138]=='40' & $sh[$i-161]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='40' & $sh[$i-138]=='40' & $sh[$i-161]=='40' & $sh[$i-1168]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='40' & $sh[$i-138]=='40' & $sh[$i-161]=='40' & $sh[$i-1168]=='40' & $sh[$i-207]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
               
            }  // конец белый ферзь вверх





if($sh[$i]=='15')  {  // проверка белый ферзь вниз есть ли шах
                           if($sh[$i+23]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='40' & $sh[$i+138]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='40' & $sh[$i+138]=='40' & $sh[$i+161]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='40' & $sh[$i+138]=='40' & $sh[$i+161]=='40' & $sh[$i+1168]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='40' & $sh[$i+138]=='40' & $sh[$i+161]=='40' & $sh[$i+1168]=='40' & $sh[$i+207]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
               
            }  // конец белый ферзь вниз







if($sh[$i]=='15')  {  // проверка белый ферзь вверх есть ли шах
                           if($sh[$i-25]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='40' & $sh[$i-150]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='40' & $sh[$i-150]=='40' & $sh[$i-175]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='40' & $sh[$i-150]=='40' & $sh[$i-175]=='40' & $sh[$i-200]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='40' & $sh[$i-150]=='40' & $sh[$i-175]=='40' & $sh[$i-200]=='40' & $sh[$i-216]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
               
            }  // конец белый ферзь вверх





if($sh[$i]=='15')  {  // проверка белый ферзь вниз есть ли шах
                           if($sh[$i+25]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='40' & $sh[$i+150]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='40' & $sh[$i+150]=='40' & $sh[$i+175]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='40' & $sh[$i+150]=='40' & $sh[$i+175]=='40' & $sh[$i+200]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='40' & $sh[$i+150]=='40' & $sh[$i+175]=='40' & $sh[$i+200]=='40' & $sh[$i+216]=='6')  {  $proverka=true; echo '<br>Шах черному  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='1';  }
               
            }  // конец белый ферзь вниз











if($sh[$i]=='5')  {  // проверка черный ферзь вверх есть ли шах
                           if($sh[$i-23]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='40' & $sh[$i-138]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='40' & $sh[$i-138]=='40' & $sh[$i-161]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='40' & $sh[$i-138]=='40' & $sh[$i-161]=='40' & $sh[$i-1168]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-23]=='40' & $sh[$i-46]=='40' & $sh[$i-69]=='40' & $sh[$i-92]=='40' & $sh[$i-115]=='40' & $sh[$i-138]=='40' & $sh[$i-161]=='40' & $sh[$i-1168]=='40' & $sh[$i-207]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
               
            }  // конец черный ферзь вверх





if($sh[$i]=='5')  {  // проверка черный ферзь вниз есть ли шах
                           if($sh[$i+23]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='40' & $sh[$i+138]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='40' & $sh[$i+138]=='40' & $sh[$i+161]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='40' & $sh[$i+138]=='40' & $sh[$i+161]=='40' & $sh[$i+1168]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+23]=='40' & $sh[$i+46]=='40' & $sh[$i+69]=='40' & $sh[$i+92]=='40' & $sh[$i+115]=='40' & $sh[$i+138]=='40' & $sh[$i+161]=='40' & $sh[$i+1168]=='40' & $sh[$i+207]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
               
            }  // конец черный ферзь вниз







if($sh[$i]=='5')  {  // проверка черный ферзь вверх есть ли шах
                           if($sh[$i-25]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='40' & $sh[$i-150]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='40' & $sh[$i-150]=='40' & $sh[$i-175]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='40' & $sh[$i-150]=='40' & $sh[$i-175]=='40' & $sh[$i-200]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i-25]=='40' & $sh[$i-50]=='40' & $sh[$i-75]=='40' & $sh[$i-100]=='40' & $sh[$i-125]=='40' & $sh[$i-150]=='40' & $sh[$i-175]=='40' & $sh[$i-200]=='40' & $sh[$i-216]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
               
            }  // конец черный ферзь вверх





if($sh[$i]=='5')  {  // проверка черный ферзь вниз есть ли шах
                           if($sh[$i+25]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='40' & $sh[$i+150]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='40' & $sh[$i+150]=='40' & $sh[$i+175]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='40' & $sh[$i+150]=='40' & $sh[$i+175]=='40' & $sh[$i+200]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
                           if($sh[$i+25]=='40' & $sh[$i+50]=='40' & $sh[$i+75]=='40' & $sh[$i+100]=='40' & $sh[$i+125]=='40' & $sh[$i+150]=='40' & $sh[$i+175]=='40' & $sh[$i+200]=='40' & $sh[$i+216]=='16')  {  $proverka=true; echo '<br>Шах белому  королю от ферзя - ['.$i.'], <font size=1><strong>( Может ошибиться )</strong></font>'; $shah='2';  }
               
            }  // конец черный ферзь вниз























                                  }  // цикл for

                        





if($hod_one<'1000' & $proverka==true) {

for($i=0;$i<300;$i++)  {  



//$sh_prov[$hod_two]=$sh_prov[$hod_one];   // экспериментально ходим, снят ли шах
if($sh_prov[$hod_one]<>'40') { $sh_prov[$hod_two]=$sh_prov[$hod_one]; $sh_prov[$hod_one]='40'; }  // экспериментально ходим, снят ли шах




if($sh_prov[$i]=='15')  {  // проверка белый ферзь вверх есть ли шах
                           if($sh_prov[$i-24]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
               if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='40' & $sh_prov[$i-216]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }


                           }  // конец белый ферзь вверх






if($sh_prov[$i]=='15')  {  // проверка белый ферзь вниз есть ли шах
                           if($sh_prov[$i+24]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
               if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='40' & $sh_prov[$i+216]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}


                           }  // конец белый ферзь вниз








if($sh_prov[$i]=='5')  {  // проверка черный ферзь вверх есть ли шах
                           if($sh_prov[$i-24]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
                           if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }
               if($sh_prov[$i-24]=='40' & $sh_prov[$i-48]=='40' & $sh_prov[$i-72]=='40' & $sh_prov[$i-96]=='40' & $sh_prov[$i-120]=='40' & $sh_prov[$i-144]=='40' & $sh_prov[$i-168]=='40' & $sh_prov[$i-192]=='40' & $sh_prov[$i-216]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000'; }


                           }  // конец черный ферзь вверх






if($sh_prov[$i]=='5')  {  // проверка черный ферзь вниз есть ли шах
                           if($sh_prov[$i+24]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
                           if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}
               if($sh_prov[$i+24]=='40' & $sh_prov[$i+48]=='40' & $sh_prov[$i+72]=='40' & $sh_prov[$i+96]=='40' & $sh_prov[$i+120]=='40' & $sh_prov[$i+144]=='40' & $sh_prov[$i+168]=='40' & $sh_prov[$i+192]=='40' & $sh_prov[$i+216]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.']'; $hod_one='1000'; $hod_two='1000';}


                           }  // конец черный ферзь вниз











if($sh_prov[$i]=='15')  {  // проверка белый ферзь влево есть ли шах
                           if($sh_prov[$i-1]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' & $sh_prov[$i-5]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='40' & $sh_prov[$i-23]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }

                           }  // конец белый ферзь влево




if($sh_prov[$i]=='15')  {  // проверка белый ферзь вправо есть ли шах
                           if($sh_prov[$i+1]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' & $sh_prov[$i+5]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='40' & $sh_prov[$i+23]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }

                           }  // конец белый ферзь вправо




// ниже =='5' и $i+1  $i-1 исправить
 

if($sh_prov[$i]=='5')  {  // проверка черный ферзь влево есть ли шах
                           if($sh_prov[$i-1]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' & $sh_prov[$i-5]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-1]=='40' & $sh_prov[$i-2]=='40' & $sh_prov[$i-3]=='40' & $sh_prov[$i-4]=='40' &  $sh_prov[$i-5]=='40' & $sh_prov[$i-6]=='40' & $sh_prov[$i-7]=='40' & $sh_prov[$i-8]=='40' & $sh_prov[$i-9]=='40' & $sh_prov[$i-10]=='40' & $sh_prov[$i-23]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }

                           }  // конец черный ферзь влево




if($sh_prov[$i]=='5')  {  // проверка черный ферзь вправо есть ли шах

                           if($sh_prov[$i+1]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' & $sh_prov[$i+5]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+1]=='40' & $sh_prov[$i+2]=='40' & $sh_prov[$i+3]=='40' & $sh_prov[$i+4]=='40' &  $sh_prov[$i+5]=='40' & $sh_prov[$i+6]=='40' & $sh_prov[$i+7]=='40' & $sh_prov[$i+8]=='40' & $sh_prov[$i+9]=='40' & $sh_prov[$i+10]=='40' & $sh_prov[$i+23]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }

                           }  // конец черный ферзь вправо

// выше =='5' и $i+1  $i-1 исправить
 









// выше проверка ферзя на мат по перпендикуляру

// ниже крест накрест
















if($sh_prov[$i]=='15')  {  // проверка белый ферзь вверх есть ли шах
                           if($sh_prov[$i-23]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='40' & $sh_prov[$i-207]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
               
            }  // конец белый ферзь вверх





if($sh_prov[$i]=='15')  {  // проверка белый ферзь вниз есть ли шах
                           if($sh_prov[$i+23]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='40' & $sh_prov[$i+207]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
               
            }  // конец белый ферзь вниз







if($sh_prov[$i]=='15')  {  // проверка белый ферзь вверх есть ли шах
                           if($sh_prov[$i-25]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='40' & $sh_prov[$i-216]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
               
            }  // конец белый ферзь вверх





if($sh_prov[$i]=='15')  {  // проверка белый ферзь вниз есть ли шах
                           if($sh_prov[$i+25]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='40' & $sh_prov[$i+216]=='6')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
               
            }  // конец белый ферзь вниз











if($sh_prov[$i]=='5')  {  // проверка черный ферзь вверх есть ли шах
                           if($sh_prov[$i-23]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-23]=='40' & $sh_prov[$i-46]=='40' & $sh_prov[$i-69]=='40' & $sh_prov[$i-92]=='40' & $sh_prov[$i-115]=='40' & $sh_prov[$i-138]=='40' & $sh_prov[$i-161]=='40' & $sh_prov[$i-1168]=='40' & $sh_prov[$i-207]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
               
            }  // конец черный ферзь вверх





if($sh_prov[$i]=='5')  {  // проверка черный ферзь вниз есть ли шах
                           if($sh_prov[$i+23]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+23]=='40' & $sh_prov[$i+46]=='40' & $sh_prov[$i+69]=='40' & $sh_prov[$i+92]=='40' & $sh_prov[$i+115]=='40' & $sh_prov[$i+138]=='40' & $sh_prov[$i+161]=='40' & $sh_prov[$i+1168]=='40' & $sh_prov[$i+207]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
               
            }  // конец черный ферзь вниз







if($sh_prov[$i]=='5')  {  // проверка черный ферзь вверх есть ли шах
                           if($sh_prov[$i-25]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i-25]=='40' & $sh_prov[$i-50]=='40' & $sh_prov[$i-75]=='40' & $sh_prov[$i-100]=='40' & $sh_prov[$i-125]=='40' & $sh_prov[$i-150]=='40' & $sh_prov[$i-175]=='40' & $sh_prov[$i-200]=='40' & $sh_prov[$i-216]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
               
            }  // конец черный ферзь вверх





if($sh_prov[$i]=='5')  {  // проверка черный ферзь вниз есть ли шах
                           if($sh_prov[$i+25]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
                           if($sh_prov[$i+25]=='40' & $sh_prov[$i+50]=='40' & $sh_prov[$i+75]=='40' & $sh_prov[$i+100]=='40' & $sh_prov[$i+125]=='40' & $sh_prov[$i+150]=='40' & $sh_prov[$i+175]=='40' & $sh_prov[$i+200]=='40' & $sh_prov[$i+216]=='16')  {  echo '<br>Шах не снят от ферзя - ['.$i.'], <font size=1><strong>( Ход отменён )</strong></font>'; $hod_one='1000'; $hod_two='1000';  }
               
            }  // конец черный ферзь вниз












// echo '&nbsp;&nbsp;&nbsp;$sh_prov['.$i.'] = '.$sh_prov[$i];

                                   }

                          }


?>