<?php

$tt2=$ok_hod_attack; unset($dona_sew); $tt2_one=$index;

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2-23]=='1') { $dona_sew='1'; }
if($sh[$tt2-25]=='1') { $dona_sew='1'; }}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2+23]=='11') { $dona_sew='1'; }
if($sh[$tt2+25]=='11') { $dona_sew='1'; }}}





                                          




if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+22]=='3') { $dona_sew='3'; }
if($sh[$tt2+26]=='3') { $dona_sew='3'; }
if($sh[$tt2-22]=='3') { $dona_sew='3'; }
if($sh[$tt2-26]=='3') { $dona_sew='3'; }

if($sh[$tt2+47]=='3') { $dona_sew='3'; }
if($sh[$tt2+49]=='3') { $dona_sew='3'; }
if($sh[$tt2-47]=='3') { $dona_sew='3'; }
if($sh[$tt2-49]=='3') { $dona_sew='3'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-22]=='13') { $dona_sew='3'; }
if($sh[$tt2-26]=='13') { $dona_sew='3'; }
if($sh[$tt2+22]=='13') { $dona_sew='3'; }
if($sh[$tt2+26]=='13') { $dona_sew='3'; }

if($sh[$tt2-47]=='13') { $dona_sew='3'; }
if($sh[$tt2-49]=='13') { $dona_sew='3'; }
if($sh[$tt2+47]=='13') { $dona_sew='3'; }
if($sh[$tt2+49]=='13') { $dona_sew='3'; }

}}











if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+23]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='4') { $dona_sew='4'; }
if($sh[$tt2-23]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='4') { $dona_sew='4'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-23]=='14') { $dona_sew='4'; }
if($sh[$tt2-25]=='14') { $dona_sew='4'; }
if($sh[$tt2+23]=='14') { $dona_sew='4'; }
if($sh[$tt2+25]=='14') { $dona_sew='4'; }

}}







                                          




if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='12') { $dona_sew='2'; }
if($sh[$tt2-24]=='12') { $dona_sew='2'; }
if($sh[$tt2+1]=='12') { $dona_sew='2'; }
if($sh[$tt2+24]=='12') { $dona_sew='2'; }

}}











                                          




if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='5') { $dona_sew='5'; }
if($sh[$tt2+24]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='5') { $dona_sew='5'; }
if($sh[$tt2-24]=='5') { $dona_sew='5'; }

if($sh[$tt2+23]=='5') { $dona_sew='5'; }
if($sh[$tt2+25]=='5') { $dona_sew='5'; }
if($sh[$tt2-23]=='5') { $dona_sew='5'; }
if($sh[$tt2-25]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='15') { $dona_sew='5'; }
if($sh[$tt2-24]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='15') { $dona_sew='5'; }
if($sh[$tt2+24]=='15') { $dona_sew='5'; }

if($sh[$tt2-23]=='15') { $dona_sew='5'; }
if($sh[$tt2-25]=='15') { $dona_sew='5'; }
if($sh[$tt2+23]=='15') { $dona_sew='5'; }
if($sh[$tt2+25]=='15') { $dona_sew='5'; }

}}







   


                                          




if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='9') { $dona_sew='9'; }
if($sh[$tt2+24]=='9') { $dona_sew='9'; }
if($sh[$tt2-1]=='9') { $dona_sew='9'; }
if($sh[$tt2-24]=='9') { $dona_sew='9'; }

if($sh[$tt2+23]=='9') { $dona_sew='9'; }
if($sh[$tt2+25]=='9') { $dona_sew='9'; }
if($sh[$tt2-23]=='9') { $dona_sew='9'; }
if($sh[$tt2-25]=='9') { $dona_sew='9'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='19') { $dona_sew='9'; }
if($sh[$tt2-24]=='19') { $dona_sew='9'; }
if($sh[$tt2+1]=='19') { $dona_sew='9'; }
if($sh[$tt2+24]=='19') { $dona_sew='9'; }

if($sh[$tt2-23]=='19') { $dona_sew='9'; }
if($sh[$tt2-25]=='19') { $dona_sew='9'; }
if($sh[$tt2+23]=='19') { $dona_sew='9'; }
if($sh[$tt2+25]=='19') { $dona_sew='9'; }

}}




   


                                          




if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='6') { $dona_sew='6'; }
if($sh[$tt2+24]=='6') { $dona_sew='6'; }
if($sh[$tt2-1]=='6') { $dona_sew='6'; }
if($sh[$tt2-24]=='6') { $dona_sew='6'; }

if($sh[$tt2+23]=='6') { $dona_sew='6'; }
if($sh[$tt2+25]=='6') { $dona_sew='6'; }
if($sh[$tt2-23]=='6') { $dona_sew='6'; }
if($sh[$tt2-25]=='6') { $dona_sew='6'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='16') { $dona_sew='6'; }
if($sh[$tt2-24]=='16') { $dona_sew='6'; }
if($sh[$tt2+1]=='16') { $dona_sew='6'; }
if($sh[$tt2+24]=='16') { $dona_sew='6'; }

if($sh[$tt2-23]=='16') { $dona_sew='6'; }
if($sh[$tt2-25]=='16') { $dona_sew='6'; }
if($sh[$tt2+23]=='16') { $dona_sew='6'; }
if($sh[$tt2+25]=='16') { $dona_sew='6'; }

}}





                                          




if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+22]=='8') { $dona_sew='8'; }
if($sh[$tt2+26]=='8') { $dona_sew='8'; }
if($sh[$tt2-22]=='8') { $dona_sew='8'; }
if($sh[$tt2-26]=='8') { $dona_sew='8'; }

if($sh[$tt2+47]=='8') { $dona_sew='8'; }
if($sh[$tt2+49]=='8') { $dona_sew='8'; }
if($sh[$tt2-47]=='8') { $dona_sew='8'; }
if($sh[$tt2-49]=='8') { $dona_sew='8'; }

if($sh[$tt2+48]=='8') { $dona_sew='8'; }
if($sh[$tt2+2]=='8') { $dona_sew='8'; }
if($sh[$tt2-48]=='8') { $dona_sew='8'; }
if($sh[$tt2-2]=='8') { $dona_sew='8'; }

if($sh[$tt2+46]=='8') { $dona_sew='8'; }
if($sh[$tt2+50]=='8') { $dona_sew='8'; }
if($sh[$tt2-46]=='8') { $dona_sew='8'; }
if($sh[$tt2-50]=='8') { $dona_sew='8'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-22]=='18') { $dona_sew='8'; }
if($sh[$tt2-26]=='18') { $dona_sew='8'; }
if($sh[$tt2+22]=='18') { $dona_sew='8'; }
if($sh[$tt2+26]=='18') { $dona_sew='8'; }

if($sh[$tt2-47]=='18') { $dona_sew='8'; }
if($sh[$tt2-49]=='18') { $dona_sew='8'; }
if($sh[$tt2+47]=='18') { $dona_sew='8'; }
if($sh[$tt2+49]=='18') { $dona_sew='8'; }

if($sh[$tt2-48]=='18') { $dona_sew='8'; }
if($sh[$tt2-2]=='18') { $dona_sew='8'; }
if($sh[$tt2+48]=='18') { $dona_sew='8'; }
if($sh[$tt2+2]=='18') { $dona_sew='8'; }

if($sh[$tt2-46]=='18') { $dona_sew='8'; }
if($sh[$tt2-50]=='18') { $dona_sew='8'; }
if($sh[$tt2+46]=='18') { $dona_sew='8'; }
if($sh[$tt2+50]=='18') { $dona_sew='8'; }

}}











                                          




if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='7') { $dona_sew='7'; }
if($sh[$tt2+24]=='7') { $dona_sew='7'; }
if($sh[$tt2-1]=='7') { $dona_sew='7'; }
if($sh[$tt2-24]=='7') { $dona_sew='7'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='17') { $dona_sew='7'; }
if($sh[$tt2-24]=='17') { $dona_sew='7'; }
if($sh[$tt2+1]=='17') { $dona_sew='7'; }
if($sh[$tt2+24]=='17') { $dona_sew='7'; }

}}









// ниже проверка через 1 клетку

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='5') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='5') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='5') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='5') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='5') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='5') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='15') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='15') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='15') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='15') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='15') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='15') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='15') { $dona_sew='5'; }

}}









// ниже проверка через 2 клетки

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='5') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='5') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='5') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='5') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='5') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='5') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='15') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='15') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='15') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='15') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='15') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='15') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='15') { $dona_sew='5'; }

}}








// ниже проверка через 3 клетки

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='5') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='5') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='5') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='5') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='5') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='5') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='15') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='15') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='15') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='15') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='15') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='15') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='15') { $dona_sew='5'; }

}}








// ниже проверка через 4 клетки

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='5') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='5') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='5') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='5') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='5') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='5') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='15') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='15') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='15') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='15') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='15') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='15') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='15') { $dona_sew='5'; }

}}







// ниже проверка через 5 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='5') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='40' && $sh[$tt2+144]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='5') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='40' && $sh[$tt2-144]=='5') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='40' && $sh[$tt2+138]=='5') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='40' && $sh[$tt2+150]=='5') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='40' && $sh[$tt2-138]=='5') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='40' && $sh[$tt2-150]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='15') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='40' && $sh[$tt2-144]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='15') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='40' && $sh[$tt2+144]=='15') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='40' && $sh[$tt2-138]=='15') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='40' && $sh[$tt2-150]=='15') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='40' && $sh[$tt2+138]=='15') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='40' && $sh[$tt2+150]=='15') { $dona_sew='5'; }

}}







// ниже проверка через 6 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='5') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='40' && $sh[$tt2+144]=='40' && $sh[$tt2+168]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='5') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='40' && $sh[$tt2+144]=='40' && $sh[$tt2-168]=='5') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='40' && $sh[$tt2+138]=='40' && $sh[$tt2+161]=='5') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='40' && $sh[$tt2+150]=='40' && $sh[$tt2+175]=='5') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='40' && $sh[$tt2-138]=='40' && $sh[$tt2-161]=='5') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='40' && $sh[$tt2-150]=='40' && $sh[$tt2-175]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='15') { $dona_sew='5'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='40' && $sh[$tt2-144]=='40' && $sh[$tt2-168]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='15') { $dona_sew='5'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='40' && $sh[$tt2+144]=='40' && $sh[$tt2+168]=='15') { $dona_sew='5'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='40' && $sh[$tt2-138]=='40' && $sh[$tt2-161]=='15') { $dona_sew='5'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='40' && $sh[$tt2-150]=='40' && $sh[$tt2-175]=='15') { $dona_sew='5'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='40' && $sh[$tt2+138]=='40' && $sh[$tt2+161]=='15') { $dona_sew='5'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='40' && $sh[$tt2+150]=='40' && $sh[$tt2+175]=='15') { $dona_sew='5'; }

}}







// ниже проверка через 7 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='15') { $dona_sew='5'; }

}}








// ниже проверка через 8 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='15') { $dona_sew='5'; }

}}







// ниже проверка через 9 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='40' && $sh[$tt2+10]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='40' && $sh[$tt2-10]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='40' && $sh[$tt2-10]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='40' && $sh[$tt2+10]=='15') { $dona_sew='5'; }

}}







// ниже проверка через 10 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='40' && $sh[$tt2+10]=='40' && $sh[$tt2+11]=='5') { $dona_sew='5'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='40' && $sh[$tt2-10]=='40' && $sh[$tt2-11]=='5') { $dona_sew='5'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='40' && $sh[$tt2-10]=='40' && $sh[$tt2-11]=='15') { $dona_sew='5'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='40' && $sh[$tt2+10]=='40' && $sh[$tt2+11]=='15') { $dona_sew='5'; }

}}








//ниже ладья
// ниже проверка через 1 клетку

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='2') { $dona_sew='2'; }

}}









// ниже проверка через 2 клетки

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='2') { $dona_sew='2'; }

}}








// ниже проверка через 3 клетки

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='2') { $dona_sew='2'; }

}}








// ниже проверка через 4 клетки

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='2') { $dona_sew='2'; }

}}







// ниже проверка через 5 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='40' && $sh[$tt2+144]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='40' && $sh[$tt2-144]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='40' && $sh[$tt2-144]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='40' && $sh[$tt2+144]=='2') { $dona_sew='2'; }

}}







// ниже проверка через 6 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='40' && $sh[$tt2+144]=='40' && $sh[$tt2+168]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='40' && $sh[$tt2+144]=='40' && $sh[$tt2-168]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='2') { $dona_sew='2'; }
if($sh[$tt2-24]=='40' && $sh[$tt2-48]=='40' && $sh[$tt2-72]=='40' && $sh[$tt2-96]=='40' && $sh[$tt2-120]=='40' && $sh[$tt2-144]=='40' && $sh[$tt2-168]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='2') { $dona_sew='2'; }
if($sh[$tt2+24]=='40' && $sh[$tt2+48]=='40' && $sh[$tt2+72]=='40' && $sh[$tt2+96]=='40' && $sh[$tt2+120]=='40' && $sh[$tt2+144]=='40' && $sh[$tt2+168]=='2') { $dona_sew='2'; }

}}







// ниже проверка через 7 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='2') { $dona_sew='2'; }

}}








// ниже проверка через 8 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='2') { $dona_sew='2'; }

}}







// ниже проверка через 9 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='40' && $sh[$tt2+10]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='40' && $sh[$tt2-10]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='40' && $sh[$tt2-10]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='40' && $sh[$tt2+10]=='2') { $dona_sew='2'; }

}}







// ниже проверка через 10 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='40' && $sh[$tt2+10]=='40' && $sh[$tt2+11]=='2') { $dona_sew='2'; }
if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='40' && $sh[$tt2-10]=='40' && $sh[$tt2-11]=='2') { $dona_sew='2'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-1]=='40' && $sh[$tt2-2]=='40' && $sh[$tt2-3]=='40' && $sh[$tt2-4]=='40' && $sh[$tt2-5]=='40' && $sh[$tt2-6]=='40' && $sh[$tt2-7]=='40' && $sh[$tt2-8]=='40' && $sh[$tt2-9]=='40' && $sh[$tt2-10]=='40' && $sh[$tt2-11]=='2') { $dona_sew='2'; }
if($sh[$tt2+1]=='40' && $sh[$tt2+2]=='40' && $sh[$tt2+3]=='40' && $sh[$tt2+4]=='40' && $sh[$tt2+5]=='40' && $sh[$tt2+6]=='40' && $sh[$tt2+7]=='40' && $sh[$tt2+8]=='40' && $sh[$tt2+9]=='40' && $sh[$tt2+10]=='40' && $sh[$tt2+11]=='2') { $dona_sew='2'; }

}}








// ниже слон
// ниже проверка через 1 клетку

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='4') { $dona_sew='4'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='4') { $dona_sew='4'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='4') { $dona_sew='4'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='4') { $dona_sew='4'; }

}}









// ниже проверка через 2 клетки

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='4') { $dona_sew='4'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='4') { $dona_sew='4'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='4') { $dona_sew='4'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='4') { $dona_sew='4'; }

}}








// ниже проверка через 3 клетки

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='4') { $dona_sew='4'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='4') { $dona_sew='4'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='4') { $dona_sew='4'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='4') { $dona_sew='4'; }

}}








// ниже проверка через 4 клетки

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='4') { $dona_sew='4'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='4') { $dona_sew='4'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='4') { $dona_sew='4'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='4') { $dona_sew='4'; }

}}







// ниже проверка через 5 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='40' && $sh[$tt2+138]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='40' && $sh[$tt2+150]=='4') { $dona_sew='4'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='40' && $sh[$tt2-138]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='40' && $sh[$tt2-150]=='4') { $dona_sew='4'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='40' && $sh[$tt2-138]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='40' && $sh[$tt2-150]=='4') { $dona_sew='4'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='40' && $sh[$tt2+138]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='40' && $sh[$tt2+150]=='4') { $dona_sew='4'; }

}}







// ниже проверка через 6 клеток

if($sh[$tt2_one]=='1' || $sh[$tt2_one]=='3' || $sh[$tt2_one]=='2' || $sh[$tt2_one]=='4' || $sh[$tt2_one]=='5' || $sh[$tt2_one]=='7' || $sh[$tt2_one]=='8' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Черные' && $exxo[4]=='Comp') {  

if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='40' && $sh[$tt2+138]=='40' && $sh[$tt2+161]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='40' && $sh[$tt2+150]=='40' && $sh[$tt2+175]=='4') { $dona_sew='4'; }
if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='40' && $sh[$tt2-138]=='40' && $sh[$tt2-161]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='40' && $sh[$tt2-150]=='40' && $sh[$tt2-175]=='4') { $dona_sew='4'; }

}}


if($sh[$tt2_one]=='11' || $sh[$tt2_one]=='13' || $sh[$tt2_one]=='12' || $sh[$tt2_one]=='14' || $sh[$tt2_one]=='15' || $sh[$tt2_one]=='17' || $sh[$tt2_one]=='18' || $sh[$tt2_one]=='9') {

if($exxo[11]=='Белые' && $exxo[3]=='Comp') { 

if($sh[$tt2-23]=='40' && $sh[$tt2-46]=='40' && $sh[$tt2-69]=='40' && $sh[$tt2-92]=='40' && $sh[$tt2-115]=='40' && $sh[$tt2-138]=='40' && $sh[$tt2-161]=='4') { $dona_sew='4'; }
if($sh[$tt2-25]=='40' && $sh[$tt2-50]=='40' && $sh[$tt2-75]=='40' && $sh[$tt2-100]=='40' && $sh[$tt2-125]=='40' && $sh[$tt2-150]=='40' && $sh[$tt2-175]=='4') { $dona_sew='4'; }
if($sh[$tt2+23]=='40' && $sh[$tt2+46]=='40' && $sh[$tt2+69]=='40' && $sh[$tt2+92]=='40' && $sh[$tt2+115]=='40' && $sh[$tt2+138]=='40' && $sh[$tt2+161]=='4') { $dona_sew='4'; }
if($sh[$tt2+25]=='40' && $sh[$tt2+50]=='40' && $sh[$tt2+75]=='40' && $sh[$tt2+100]=='40' && $sh[$tt2+125]=='40' && $sh[$tt2+150]=='40' && $sh[$tt2+175]=='4') { $dona_sew='4'; }

}}












 $figure_price = array(
   // ценность фигур
// .....
   1 => '10',
   2 => '200',
   3 => '30',
   4 => '100',
   5 => '500',
   6 => '1000',
   11 => '10',
   12 => '200',
   13 => '30',
   14 => '100',
   15 => '500',
   16 => '1000',
   40 => '0',
   80 => '0',
     81 => '80',
 7 => '50',
   17 => '50',
   18 => '60',
   8 => '60',
   19 => '40',
   9 => '40',
   82 => '200',
   83 => '0',
 84 => '400',
 85 => '400',
 90 => '400',
 92 => '400',
93 => '400',
     //.....
 );


//if($figure_price[$sh[$hod_one]]<=$figure_price[$sh[$hod_two]]) { $dobro_attack='Da'; } else $dobro_attack='Net'; 



if(!$shah) {                                                                                 

if($dona_sew=='1') { echo 'Атака одобрена,под защиту пешкой<br>'; }
if($dona_sew=='3') { echo 'Атака одобрена,под защиту конем<br>'; }
if($dona_sew=='4') { echo 'Атака одобрена,под защиту слоном<br>'; }
if($dona_sew=='2') { echo 'Атака одобрена,под защиту ладьей<br>'; }
if($dona_sew=='5') { echo 'Атака одобрена,под защиту ферзем<br>'; }
if($dona_sew=='9') { echo 'Атака одобрена,под защиту отшельником<br>'; }
if($dona_sew=='8') { echo 'Атака одобрена,под защиту стрелой<br>'; }
if($dona_sew=='7') { echo 'Атака одобрена,под защиту драконом<br>'; }
if($dona_sew=='6') { echo 'Атака одобрена,под защиту королем<br>'; }

                 }

?>